yooaroma/yoo_stm8s_sdcc/project/STM8S_Mib/src/stm8s_mib_ds18b20_dtemp.c
/**
 ******************************************************************************
 * @file stm8s_mib_pcf8591.c
 * @brief
 * @author MYMEDIA Co., Ltd.
 * @version V1.0.0
 * @date 2023.1.6
 ******************************************************************************
 */
#include "stm8s.h"
#include "stm8s_mib_i2c.h"
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
#define DS18B20_PORT GPIOD
#define DS18B20_PIN GPIO_PIN_3
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
void DS18B20_Mode_Out(void);
void DS18B20_Mode_In(void);
uint8_t DS18B20_Reset(void);
void DS18B20_WriteByte(uint8_t data);
uint8_t DS18B20_ReadByte(void);
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
// 16MHz 기준 약 1us 딜레이 (컴파일러 최적화 방지를 위해 nop 사용)
void delay_us(uint16_t us)
{
  while (us--)
  {
    nop();
    nop();  
    nop();  
  }
}
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
// DQ 핀을 출력 모드로 변경
void DS18B20_Mode_Out(void)
{
  DS18B20_PORT->DDR |= DS18B20_PIN; // Output
  DS18B20_PORT->CR1 |= DS18B20_PIN; // Push-pull
}
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
// DQ 핀을 입력 모드로 변경
void DS18B20_Mode_In(void)
{
  DS18B20_PORT->DDR &= ~DS18B20_PIN; // Input
  DS18B20_PORT->CR1 &= ~DS18B20_PIN; // Floating
}
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
/*
  1-Wire는 리셋 신호와 존재 펄스(Presence Pulse)를 통해 통신 시작을 알립니다.
*/
// 리셋 및 존재 확인
uint8_t DS18B20_Reset(void)
{
  uint8_t presence = 0;
  DS18B20_Mode_Out();
  DS18B20_PORT->ODR &= ~DS18B20_PIN; // Low로 당김
  delay_us(480);                     // 480us 유지
  DS18B20_Mode_In();                 // 핀을 놓음 (풀업 저항에 의해 High가 됨)
  delay_us(80);                      // 센서가 응답할 때까지 대기

  if (!(DS18B20_PORT->IDR & DS18B20_PIN))
    presence = 1; // 센서가 Low를 보내면 성공
  delay_us(400);  // 나머지 시간 대기
  return presence;
}
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
// 1바이트 쓰기
void DS18B20_WriteByte(uint8_t data)
{
  uint8_t i;
  DS18B20_Mode_Out();
  for (i = 0; i < 8; i++)
  {
    DS18B20_PORT->ODR &= ~DS18B20_PIN; // 통신 시작 (Low)
    delay_us(2);
    if (data & 0x01)
      DS18B20_PORT->ODR |= DS18B20_PIN; // '1' 전송
    else
      DS18B20_PORT->ODR &= ~DS18B20_PIN; // '0' 전송
    delay_us(60);
    DS18B20_PORT->ODR |= DS18B20_PIN; // 핀 릴리즈
    data >>= 1;
  }
}
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
// 1바이트 읽기
uint8_t DS18B20_ReadByte(void)
{
  uint8_t i, data = 0;
  for (i = 0; i < 8; i++)
  {
    DS18B20_Mode_Out();
    DS18B20_PORT->ODR &= ~DS18B20_PIN; // 읽기 시작 신호 (Low)
    delay_us(2);
    DS18B20_Mode_In(); // MCU 핀을 입력으로 전환
    delay_us(10);      // 센서가 데이터를 실어 보낼 때까지 대기
    data >>= 1;
    if (DS18B20_PORT->IDR & DS18B20_PIN)
      data |= 0x80;
    delay_us(50);
  }
  return data;
}
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
